In [1]:
import pandas as pd
import pyodbc

In [2]:
# Establish connection
conn = pyodbc.connect(
    "DRIVER={ODBC Driver 17 for SQL Server};"
    "SERVER=DESKTOP-JUPQFSM\SQLEXPRESS;"
    "DATABASE=datavault;"
    "Trusted_Connection=yes;"
)

In [5]:
query = "Select * from sales"

In [ ]:
df = pd.read_sql_query(query,conn)

C:\Users\DELL\AppData\Local\Temp\ipykernel_7936\3871150124.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query,conn)

In [7]:
df.head(4)

,order_id,Order_Date,item_id,Category,Sub_Category,Sub_Sub_Category,Brand,Unit_Price,Qty,Discount Percent,Unit_Cost,City,State,Region,loc_id,Order_Type,Payment_Method,Customer_id
0,2421.0,2013-12-31,860.0,Mobile Phones,Smartphones,Android Phones,iBall,96.861099,1.0,0.305252,68.621803,San Francisco,California,North,29.0,Contact Center,Credit Card EMI,321029.0
1,4437.0,2013-02-25,1620.0,Footwear,Women Footwear,Sports Sandals,Adidas,46.916698,1.0,0.327013,42.831799,San Jose,California,North,40.0,Contact Center,Cash on Delivery,237040.0
2,32690.0,2013-07-27,1951.0,Cameras,Camera,Digital SLR,Sony,1333.329956,1.0,0.019674,938.179016,Los Angeles,California,North,23.0,Contact Center,Debit Card,140023.0
3,32914.0,2013-07-25,2412.0,Computer Hardware,Printers,Inkjet,HP,138.889008,1.0,0.133727,130.639999,San Francisco,California,North,29.0,Contact Center,Credit Card,364029.0

In [22]:
#find the total sales using unit_price and Qty fields
df['Sales'] = df['Unit_Price'] * df['Qty'].astype(int)

In [23]:
df[['Unit_Price','Qty','Sales']].tail(20)
# df[df['Qty'] == 2.]

       Unit_Price  Qty      Sales
45872   19.444401  1.0  19.444401
45873   19.444401  1.0  19.444401
45874   19.444401  1.0  19.444401
45875   22.222200  1.0  22.222200
45876   44.416698  1.0  44.416698
45877   36.083302  1.0  36.083302
45878   27.750000  1.0  27.750000
45879   27.750000  1.0  27.750000
45880   55.527802  1.0  55.527802
45881   19.444401  1.0  19.444401
45882   46.916698  1.0  46.916698
45883   44.416698  1.0  44.416698
45884   27.750000  1.0  27.750000
45885   27.750000  1.0  27.750000
45886   27.750000  1.0  27.750000
45887   27.750000  1.0  27.750000
45888   55.527802  1.0  55.527802
45889   55.527802  1.0  55.527802
45890   19.444401  1.0  19.444401
45891   19.444401  1.0  19.444401

1.Total Sales by category

In [20]:
Sales_by_Category = df.groupby('Category')['Sales'].sum().reset_index()

In [21]:
print(Sales_by_Category.head(20))

            Category         Sales
0            Cameras  2.155049e+06
1           Clothing  4.167938e+05
2  Computer Hardware  5.570059e+06
3           Footwear  5.139076e+05
4      Mobile Phones  1.455517e+06
5            Watches  2.759806e+05

2.Higest Sales by Sub Category

In [40]:
df.head(2)

,order_id,Order_Date,item_id,Category,Sub_Category,Sub_Sub_Category,Brand,Unit_Price,Qty,Discount Percent,Unit_Cost,City,State,Region,loc_id,Order_Type,Payment_Method,Customer_id,Sales,Revenue
0,2421.0,2013-12-31,860.0,Mobile Phones,Smartphones,Android Phones,iBall,96.861099,1.0,0.305252,68.621803,San Francisco,California,North,29.0,Contact Center,Credit Card EMI,321029.0,96.861099,67.294056
1,4437.0,2013-02-25,1620.0,Footwear,Women Footwear,Sports Sandals,Adidas,46.916698,1.0,0.327013,42.831799,San Jose,California,North,40.0,Contact Center,Cash on Delivery,237040.0,46.916698,31.574329

In [37]:
df.loc[df['Sales'].idxmax(), ['Sub_Category', 'Sales']]
# df['Sales'].max()

Sub_Category    Laptops
Sales           25000.0
Name: 32903, dtype: object

In [38]:
df['Revenue'] = (df['Unit_Price'] * df['Qty']) * (1 - df['Discount Percent'])

In [39]:
df['Revenue']

0          67.294056
1          31.574329
2        1307.098155
3         120.315797
4        1250.464773
            ...
45887      26.487747
45888      39.608037
45889      40.877291
45890      16.844762
45891      14.623648
Name: Revenue, Length: 45892, dtype: float64

3.Top 5 Brands by revenue

In [41]:
df.head(2)

,order_id,Order_Date,item_id,Category,Sub_Category,Sub_Sub_Category,Brand,Unit_Price,Qty,Discount Percent,Unit_Cost,City,State,Region,loc_id,Order_Type,Payment_Method,Customer_id,Sales,Revenue
0,2421.0,2013-12-31,860.0,Mobile Phones,Smartphones,Android Phones,iBall,96.861099,1.0,0.305252,68.621803,San Francisco,California,North,29.0,Contact Center,Credit Card EMI,321029.0,96.861099,67.294056
1,4437.0,2013-02-25,1620.0,Footwear,Women Footwear,Sports Sandals,Adidas,46.916698,1.0,0.327013,42.831799,San Jose,California,North,40.0,Contact Center,Cash on Delivery,237040.0,46.916698,31.574329

In [52]:
top_5_brands = df.groupby('Brand')['Sales'].sum().nlargest(5)
print(top_5_brands)

Brand
Lenovo     1.398385e+06
Samsung    1.229416e+06
Dell       1.089950e+06
Apple      9.422786e+05
Acer       8.326391e+05
Name: Sales, dtype: float64

4. Find the Lenovo Brans Sales

In [63]:
Lenovo_Sales = df[df['Brand'] == 'Lenovo']['Sales'].sum()
print(Lenovo_Sales)

1397785

In [62]:
df['Sales'].astype(int)

0          96
1          46
2        1333
3         138
4        1426
         ...
45887      27
45888      55
45889      55
45890      19
45891      19
Name: Sales, Length: 45892, dtype: int32

5.Most Popular Payment method

In [64]:
df.head(2)

,order_id,Order_Date,item_id,Category,Sub_Category,Sub_Sub_Category,Brand,Unit_Price,Qty,Discount Percent,Unit_Cost,City,State,Region,loc_id,Order_Type,Payment_Method,Customer_id,Sales,Revenue
0,2421.0,2013-12-31,860.0,Mobile Phones,Smartphones,Android Phones,iBall,96.861099,1.0,0.305252,68.621803,San Francisco,California,North,29.0,Contact Center,Credit Card EMI,321029.0,96,67.294056
1,4437.0,2013-02-25,1620.0,Footwear,Women Footwear,Sports Sandals,Adidas,46.916698,1.0,0.327013,42.831799,San Jose,California,North,40.0,Contact Center,Cash on Delivery,237040.0,46,31.574329

In [68]:
df.groupby('Payment_Method')['order_id'].count().sort_values(ascending=False).head(1)

Payment_Method
Credit Card    8885
Name: order_id, dtype: int64

6. Average Discount rate per category

In [75]:
df.groupby('Category')['Discount Percent'].mean().nlargest(1)

Category
Mobile Phones    0.179583
Name: Discount Percent, dtype: float64